; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=291, out_folder=./training, instance_id=57, seed=2081, goal_proportion=0.03

(define (problem blocksworld-57)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 - object)
 (:init 
    (arm-empty)
    (clear b265)
    (on b265 b69)
    (on-table b69)
    (clear b91)
    (on b91 b170)
    (on b170 b213)
    (on-table b213)
    (clear b289)
    (on b289 b224)
    (on b224 b143)
    (on b143 b54)
    (on b54 b159)
    (on b159 b37)
    (on b37 b220)
    (on-table b220)
    (clear b200)
    (on b200 b126)
    (on-table b126)
    (clear b35)
    (on b35 b228)
    (on-table b228)
    (clear b169)
    (on b169 b245)
    (on-table b245)
    (clear b96)
    (on b96 b123)
    (on b123 b133)
    (on-table b133)
    (clear b124)
    (on b124 b34)
    (on b34 b171)
    (on b171 b204)
    (on-table b204)
    (clear b8)
    (on b8 b64)
    (on b64 b70)
    (on-table b70)
    (clear b231)
    (on b231 b278)
    (on-table b278)
    (clear b116)
    (on-table b116)
    (clear b15)
    (on b15 b4)
    (on b4 b121)
    (on b121 b239)
    (on b239 b281)
    (on b281 b128)
    (on b128 b115)
    (on b115 b21)
    (on-table b21)
    (clear b56)
    (on-table b56)
    (clear b100)
    (on b100 b107)
    (on b107 b161)
    (on b161 b191)
    (on b191 b164)
    (on-table b164)
    (clear b98)
    (on b98 b80)
    (on b80 b112)
    (on-table b112)
    (clear b218)
    (on b218 b45)
    (on-table b45)
    (clear b222)
    (on-table b222)
    (clear b2)
    (on b2 b23)
    (on b23 b279)
    (on b279 b111)
    (on-table b111)
    (clear b105)
    (on b105 b16)
    (on-table b16)
    (clear b268)
    (on b268 b285)
    (on b285 b7)
    (on-table b7)
    (clear b141)
    (on b141 b92)
    (on b92 b216)
    (on-table b216)
    (clear b79)
    (on b79 b85)
    (on b85 b118)
    (on b118 b192)
    (on b192 b273)
    (on b273 b46)
    (on-table b46)
    (clear b287)
    (on-table b287)
    (clear b168)
    (on b168 b28)
    (on-table b28)
    (clear b206)
    (on b206 b290)
    (on-table b290)
    (clear b76)
    (on b76 b1)
    (on-table b1)
    (clear b5)
    (on-table b5)
    (clear b74)
    (on b74 b266)
    (on-table b266)
    (clear b277)
    (on b277 b173)
    (on-table b173)
    (clear b158)
    (on b158 b242)
    (on-table b242)
    (clear b135)
    (on b135 b134)
    (on b134 b146)
    (on-table b146)
    (clear b55)
    (on b55 b142)
    (on b142 b227)
    (on b227 b59)
    (on-table b59)
    (clear b183)
    (on b183 b40)
    (on b40 b50)
    (on b50 b73)
    (on-table b73)
    (clear b26)
    (on b26 b44)
    (on b44 b270)
    (on b270 b137)
    (on b137 b41)
    (on-table b41)
    (clear b193)
    (on b193 b152)
    (on b152 b19)
    (on b19 b63)
    (on b63 b189)
    (on b189 b81)
    (on b81 b6)
    (on b6 b71)
    (on b71 b139)
    (on b139 b198)
    (on b198 b47)
    (on b47 b272)
    (on b272 b31)
    (on b31 b132)
    (on b132 b57)
    (on b57 b27)
    (on b27 b22)
    (on b22 b288)
    (on b288 b3)
    (on b3 b129)
    (on b129 b86)
    (on b86 b199)
    (on-table b199)
    (clear b246)
    (on b246 b119)
    (on-table b119)
    (clear b255)
    (on b255 b203)
    (on b203 b190)
    (on b190 b30)
    (on b30 b284)
    (on b284 b162)
    (on b162 b196)
    (on b196 b269)
    (on b269 b185)
    (on b185 b230)
    (on b230 b106)
    (on b106 b249)
    (on b249 b256)
    (on b256 b58)
    (on b58 b275)
    (on b275 b259)
    (on b259 b195)
    (on b195 b13)
    (on-table b13)
    (clear b122)
    (on-table b122)
    (clear b114)
    (on b114 b251)
    (on-table b251)
    (clear b25)
    (on b25 b18)
    (on b18 b176)
    (on-table b176)
    (clear b60)
    (on b60 b62)
    (on b62 b187)
    (on-table b187)
    (clear b33)
    (on b33 b20)
    (on b20 b232)
    (on b232 b120)
    (on-table b120)
    (clear b283)
    (on b283 b38)
    (on b38 b104)
    (on b104 b207)
    (on b207 b215)
    (on-table b215)
    (clear b194)
    (on b194 b211)
    (on b211 b175)
    (on-table b175)
    (clear b209)
    (on b209 b271)
    (on b271 b186)
    (on b186 b181)
    (on b181 b291)
    (on-table b291)
    (clear b257)
    (on-table b257)
    (clear b78)
    (on b78 b214)
    (on b214 b280)
    (on-table b280)
    (clear b260)
    (on-table b260)
    (clear b66)
    (on b66 b276)
    (on b276 b163)
    (on b163 b136)
    (on-table b136)
    (clear b93)
    (on-table b93)
    (clear b153)
    (on-table b153)
    (clear b12)
    (on b12 b226)
    (on b226 b110)
    (on b110 b138)
    (on b138 b103)
    (on-table b103)
    (clear b244)
    (on b244 b236)
    (on b236 b179)
    (on-table b179)
    (clear b252)
    (on b252 b68)
    (on b68 b182)
    (on b182 b144)
    (on b144 b32)
    (on b32 b237)
    (on b237 b221)
    (on b221 b53)
    (on b53 b67)
    (on b67 b39)
    (on b39 b145)
    (on b145 b150)
    (on b150 b83)
    (on b83 b250)
    (on-table b250)
    (clear b51)
    (on-table b51)
    (clear b87)
    (on-table b87)
    (clear b48)
    (on-table b48)
    (clear b184)
    (on b184 b241)
    (on-table b241)
    (clear b125)
    (on b125 b140)
    (on b140 b267)
    (on b267 b253)
    (on b253 b212)
    (on-table b212)
    (clear b166)
    (on b166 b61)
    (on b61 b43)
    (on-table b43)
    (clear b174)
    (on-table b174)
    (clear b157)
    (on b157 b75)
    (on b75 b49)
    (on b49 b127)
    (on-table b127)
    (clear b156)
    (on b156 b17)
    (on b17 b101)
    (on b101 b263)
    (on b263 b94)
    (on b94 b247)
    (on-table b247)
    (clear b130)
    (on b130 b77)
    (on b77 b197)
    (on-table b197)
    (clear b178)
    (on-table b178)
    (clear b177)
    (on b177 b88)
    (on b88 b234)
    (on b234 b254)
    (on-table b254)
    (clear b225)
    (on b225 b42)
    (on-table b42)
    (clear b148)
    (on b148 b201)
    (on b201 b24)
    (on-table b24)
    (clear b258)
    (on-table b258)
    (clear b217)
    (on b217 b235)
    (on-table b235)
    (clear b154)
    (on b154 b84)
    (on b84 b286)
    (on b286 b89)
    (on b89 b240)
    (on b240 b109)
    (on b109 b149)
    (on b149 b65)
    (on b65 b131)
    (on b131 b180)
    (on b180 b10)
    (on-table b10)
    (clear b165)
    (on-table b165)
    (clear b14)
    (on b14 b9)
    (on b9 b167)
    (on-table b167)
    (clear b99)
    (on-table b99)
    (clear b113)
    (on-table b113)
    (clear b172)
    (on b172 b261)
    (on b261 b117)
    (on-table b117)
    (clear b208)
    (on b208 b11)
    (on b11 b52)
    (on b52 b264)
    (on b264 b248)
    (on b248 b238)
    (on b238 b219)
    (on b219 b72)
    (on b72 b147)
    (on b147 b233)
    (on b233 b160)
    (on b160 b202)
    (on b202 b205)
    (on-table b205)
    (clear b262)
    (on b262 b155)
    (on b155 b95)
    (on b95 b151)
    (on-table b151)
    (clear b82)
    (on b82 b188)
    (on b188 b108)
    (on-table b108)
    (clear b282)
    (on-table b282)
    (clear b102)
    (on b102 b210)
    (on b210 b90)
    (on b90 b223)
    (on b223 b274)
    (on b274 b36)
    (on-table b36)
    (clear b229)
    (on b229 b29)
    (on-table b29)
    (clear b97)
    (on b97 b243)
    (on-table b243))
 (:goal  (and 
    (clear b4)
    (on-table b4)
    (clear b3)
    (on b3 b8)
    (on b8 b6)
    (on b6 b1)
    (on b1 b5)
    (on-table b5)
    (clear b2)
    (on b2 b7)
    (on-table b7))))

; plan
1. (unstack b15 b4)
   deleted: (on b15 b4) (clear b15) (arm-empty)
   added: (holding b15) (clear b4)
   goals met: 4 of 11
2. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 11
3. (unstack b4 b121)
   deleted: (on b4 b121) (clear b4) (arm-empty)
   added: (holding b4) (clear b121)
   goals met: 3 of 11
4. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 11
5. (unstack b193 b152)
   deleted: (on b193 b152) (clear b193) (arm-empty)
   added: (holding b193) (clear b152)
   goals met: 5 of 11
6. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 5 of 11
7. (unstack b152 b19)
   deleted: (on b152 b19) (clear b152) (arm-empty)
   added: (holding b152) (clear b19)
   goals met: 5 of 11
8. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 5 of 11
9. (unstack b19 b63)
   deleted: (on b19 b63) (clear b19) (arm-empty)
   added: (holding b19) (clear b63)
   goals met: 5 of 11
10. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 5 of 11
11. (unstack b268 b285)
   deleted: (on b268 b285) (clear b268) (arm-empty)
   added: (holding b268) (clear b285)
   goals met: 5 of 11
12. (putdown b268)
   deleted: (holding b268)
   added: (clear b268) (arm-empty) (on-table b268)
   goals met: 5 of 11
13. (unstack b285 b7)
   deleted: (on b285 b7) (clear b285) (arm-empty)
   added: (holding b285) (clear b7)
   goals met: 5 of 11
14. (putdown b285)
   deleted: (holding b285)
   added: (clear b285) (arm-empty) (on-table b285)
   goals met: 5 of 11
15. (unstack b63 b189)
   deleted: (on b63 b189) (clear b63) (arm-empty)
   added: (holding b63) (clear b189)
   goals met: 5 of 11
16. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 5 of 11
17. (unstack b189 b81)
   deleted: (on b189 b81) (clear b189) (arm-empty)
   added: (holding b189) (clear b81)
   goals met: 5 of 11
18. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 5 of 11
19. (unstack b76 b1)
   deleted: (on b76 b1) (clear b76) (arm-empty)
   added: (holding b76) (clear b1)
   goals met: 5 of 11
20. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 5 of 11
21. (unstack b81 b6)
   deleted: (on b81 b6) (clear b81) (arm-empty)
   added: (holding b81) (clear b6)
   goals met: 5 of 11
22. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 5 of 11
23. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 11
24. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 6 of 11
25. (unstack b6 b71)
   deleted: (on b6 b71) (clear b6) (arm-empty)
   added: (holding b6) (clear b71)
   goals met: 6 of 11
26. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 7 of 11
27. (unstack b71 b139)
   deleted: (on b71 b139) (clear b71) (arm-empty)
   added: (holding b71) (clear b139)
   goals met: 7 of 11
28. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 7 of 11
29. (unstack b139 b198)
   deleted: (on b139 b198) (clear b139) (arm-empty)
   added: (holding b139) (clear b198)
   goals met: 7 of 11
30. (putdown b139)
   deleted: (holding b139)
   added: (clear b139) (arm-empty) (on-table b139)
   goals met: 7 of 11
31. (unstack b198 b47)
   deleted: (on b198 b47) (clear b198) (arm-empty)
   added: (holding b198) (clear b47)
   goals met: 7 of 11
32. (putdown b198)
   deleted: (holding b198)
   added: (clear b198) (arm-empty) (on-table b198)
   goals met: 7 of 11
33. (unstack b47 b272)
   deleted: (on b47 b272) (clear b47) (arm-empty)
   added: (holding b47) (clear b272)
   goals met: 7 of 11
34. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 7 of 11
35. (unstack b272 b31)
   deleted: (on b272 b31) (clear b272) (arm-empty)
   added: (holding b272) (clear b31)
   goals met: 7 of 11
36. (putdown b272)
   deleted: (holding b272)
   added: (clear b272) (arm-empty) (on-table b272)
   goals met: 7 of 11
37. (unstack b31 b132)
   deleted: (on b31 b132) (clear b31) (arm-empty)
   added: (holding b31) (clear b132)
   goals met: 7 of 11
38. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 7 of 11
39. (unstack b132 b57)
   deleted: (on b132 b57) (clear b132) (arm-empty)
   added: (holding b132) (clear b57)
   goals met: 7 of 11
40. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 7 of 11
41. (unstack b57 b27)
   deleted: (on b57 b27) (clear b57) (arm-empty)
   added: (holding b57) (clear b27)
   goals met: 7 of 11
42. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 7 of 11
43. (unstack b27 b22)
   deleted: (on b27 b22) (clear b27) (arm-empty)
   added: (holding b27) (clear b22)
   goals met: 7 of 11
44. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 7 of 11
45. (unstack b22 b288)
   deleted: (on b22 b288) (clear b22) (arm-empty)
   added: (holding b22) (clear b288)
   goals met: 7 of 11
46. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 7 of 11
47. (unstack b288 b3)
   deleted: (on b288 b3) (clear b288) (arm-empty)
   added: (holding b288) (clear b3)
   goals met: 8 of 11
48. (putdown b288)
   deleted: (holding b288)
   added: (clear b288) (arm-empty) (on-table b288)
   goals met: 8 of 11
49. (unstack b8 b64)
   deleted: (on b8 b64) (clear b8) (arm-empty)
   added: (holding b8) (clear b64)
   goals met: 8 of 11
50. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 9 of 11
51. (unstack b2 b23)
   deleted: (on b2 b23) (clear b2) (arm-empty)
   added: (holding b2) (clear b23)
   goals met: 8 of 11
52. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 10 of 11
53. (unstack b3 b129)
   deleted: (on b3 b129) (clear b3) (arm-empty)
   added: (holding b3) (clear b129)
   goals met: 9 of 11
54. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 11 of 11
